In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv("drug.csv")
df

     Age Sex      BP Cholesterol  Na_to_K   Drug
0     23   F    HIGH        HIGH   25.355  drugY
1     47   M     LOW        HIGH   13.093  drugC
2     47   M     LOW        HIGH   10.114  drugC
3     28   F  NORMAL        HIGH    7.798  drugX
4     61   F     LOW        HIGH   18.043  drugY
..   ...  ..     ...         ...      ...    ...
195   56   F     LOW        HIGH   11.567  drugC
196   16   M     LOW        HIGH   12.006  drugC
197   52   M  NORMAL        HIGH    9.894  drugX
198   23   M  NORMAL      NORMAL   14.020  drugX
199   40   F     LOW      NORMAL   11.349  drugX

[200 rows x 6 columns]

In [2]:
df.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug
0   23   F    HIGH        HIGH   25.355  drugY
1   47   M     LOW        HIGH   13.093  drugC
2   47   M     LOW        HIGH   10.114  drugC
3   28   F  NORMAL        HIGH    7.798  drugX
4   61   F     LOW        HIGH   18.043  drugY

In [3]:
df.tail()

     Age Sex      BP Cholesterol  Na_to_K   Drug
195   56   F     LOW        HIGH   11.567  drugC
196   16   M     LOW        HIGH   12.006  drugC
197   52   M  NORMAL        HIGH    9.894  drugX
198   23   M  NORMAL      NORMAL   14.020  drugX
199   40   F     LOW      NORMAL   11.349  drugX

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Age          200 non-null    int64
 1   Sex          200 non-null    object
 2   BP           200 non-null    object
 3   Cholesterol  200 non-null    object
 4   Na_to_K      200 non-null    float64
 5   Drug         200 non-null    object
dtypes: float64(1), int64(1), object(4)
memory usage: 9.5+ KB

In [5]:
df.describe()

              Age     Na_to_K
count  200.000000  200.000000
mean    44.315000   16.084485
std     16.544315    7.223956
min     15.000000    6.269000
25%     31.000000   10.445500
50%     45.000000   13.936500
75%     58.000000   19.380000
max     74.000000   38.247000

In [6]:
df.min()

Age               15
Sex                F
BP              HIGH
Cholesterol     HIGH
Na_to_K        6.269
Drug           drugA
dtype: object

In [7]:
df.max()

Age                74
Sex                 M
BP             NORMAL
Cholesterol    NORMAL
Na_to_K        38.247
Drug            drugY
dtype: object

In [8]:
df2 = df
df2.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug
0   23   F    HIGH        HIGH   25.355  drugY
1   47   M     LOW        HIGH   13.093  drugC
2   47   M     LOW        HIGH   10.114  drugC
3   28   F  NORMAL        HIGH    7.798  drugX
4   61   F     LOW        HIGH   18.043  drugY

In [9]:
from sklearn.preprocessing import LabelEncoder
leSex = LabelEncoder()
leBp = LabelEncoder()
leChol = LabelEncoder()
leDrug = LabelEncoder()
df['n_sex'] = leSex.fit_transform(df['Sex'])
df['n_bp'] = leBp.fit_transform(df['BP'])
df['n_chol'] = leChol.fit_transform(df['Cholesterol'])
df['n_drug'] = leDrug.fit_transform(df['Drug'])
df.head()

   Age Sex      BP Cholesterol  Na_to_K   Drug  n_sex  n_bp  n_chol  n_drug
0   23   F    HIGH        HIGH   25.355  drugY      0     0       0       4
1   47   M     LOW        HIGH   13.093  drugC      1     1       0       2
2   47   M     LOW        HIGH   10.114  drugC      1     1       0       2
3   28   F  NORMAL        HIGH    7.798  drugX      0     2       0       3
4   61   F     LOW        HIGH   18.043  drugY      0     1       0       4

In [10]:
df = df.drop(['Sex','BP','Cholesterol','Drug'],axis=1)
df.head()

   Age  Na_to_K  n_sex  n_bp  n_chol  n_drug
0   23   25.355      0     0       0       4
1   47   13.093      1     1       0       2
2   47   10.114      1     1       0       2
3   28    7.798      0     2       0       3
4   61   18.043      0     1       0       4

In [11]:
myCols = ['Age','Na_to_K','n_sex','n_bp','n_chol','n_drug']
df = df.reindex(columns = myCols)
df.head()

   Age  Na_to_K  n_sex  n_bp  n_chol  n_drug
0   23   25.355      0     0       0       4
1   47   13.093      1     1       0       2
2   47   10.114      1     1       0       2
3   28    7.798      0     2       0       3
4   61   18.043      0     1       0       4

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Age      200 non-null    int64
 1   Na_to_K  200 non-null    float64
 2   n_sex    200 non-null    int32
 3   n_bp     200 non-null    int32
 4   n_chol   200 non-null    int32
 5   n_drug   200 non-null    int32
dtypes: float64(1), int32(4), int64(1)
memory usage: 6.4 KB

In [13]:
a = df[['Age','Na_to_K','n_sex','n_bp','n_chol']]
b = df[['n_drug']]

In [14]:
from sklearn.model_selection import train_test_split
a_train,a_test,b_train,b_test = train_test_split(a,b,test_size=0.3)

In [15]:
from sklearn import tree
myMod = tree.DecisionTreeClassifier()
myMod.fit(a_train,b_train)

DecisionTreeClassifier()

In [16]:
myMod.predict(a_test)

array([4, 3, 1, 2, 3, 0, 2, 4, 1, 0, 3, 3, 3, 1, 3, 4, 3, 4, 4, 3, 4, 0,
       0, 3, 3, 4, 4, 4, 0, 0, 4, 3, 3, 4, 4, 2, 0, 4, 3, 4, 4, 4, 4, 1,
       3, 0, 4, 4, 3, 4, 4, 4, 4, 4, 3, 1, 3, 1, 4, 0])

In [17]:
b_test.head()

     n_drug
8         4
148       3
142       1
84        2
116       3

In [18]:
a_test.head()

     Age  Na_to_K  n_sex  n_bp  n_chol
8     60   15.171      1     2       0
148   61    7.340      0     1       1
142   60    8.621      1     0       1
84    47   10.067      0     1       0
116   67    9.514      1     2       1

# Accuracy for 70/30 dataset:

In [19]:
print("Accuracy of model is: ",myMod.score(a_test,b_test)*100,"%")

Accuracy of model is:  96.66666666666667 %

# For dataframe with 80/20 ratio

In [20]:
df2 = df
df2.head()

   Age  Na_to_K  n_sex  n_bp  n_chol  n_drug
0   23   25.355      0     0       0       4
1   47   13.093      1     1       0       2
2   47   10.114      1     1       0       2
3   28    7.798      0     2       0       3
4   61   18.043      0     1       0       4

In [21]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Age      200 non-null    int64
 1   Na_to_K  200 non-null    float64
 2   n_sex    200 non-null    int32
 3   n_bp     200 non-null    int32
 4   n_chol   200 non-null    int32
 5   n_drug   200 non-null    int32
dtypes: float64(1), int32(4), int64(1)
memory usage: 6.4 KB

In [22]:
x = df[['Age','Na_to_K','n_sex','n_bp','n_chol']]
y = df[['n_drug']]

In [23]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(x,y,test_size=0.2)

In [24]:
from sklearn import tree
mod = tree.DecisionTreeClassifier()
mod.fit(x_train,y_train)

DecisionTreeClassifier()

In [25]:
mod.predict(x_test)

array([2, 4, 3, 1, 4, 4, 3, 3, 4, 4, 0, 3, 3, 3, 4, 4, 0, 4, 4, 1, 3, 2,
       1, 3, 4, 0, 3, 4, 0, 1, 1, 4, 3, 4, 0, 2, 1, 0, 3, 4])

In [26]:
y_test.head()

    n_drug
7        2
77       4
86       3
54       1
73       4

# Accuracy for 80/20 ratio:

In [27]:
print("Accuracy of model is: ",mod.score(x_test,y_test)*100,"%")

Accuracy of model is:  100.0 %

80/20 ratio dataset is more accurate as compared to 70/30, this is because 80/20 is getting more data to train itself. first dataset is getting 80 percent to train itself and second dataset is getting 70 percent to train itself. Also i am getting more accuracy in second dataset which is 100% and 98% for first dataset